<?php

return [
    /*
    |--------------------------------------------------------------------------
    | Драйвер корзины
    |--------------------------------------------------------------------------
    |
    | Доступные: 'database', 'session'
    |
    */
    'driver' => env('CART_DRIVER', 'database'),

    'cookie' => [
        'name' => 'cart_id',
        'lifetime' => 60 * 24 * 365, // 1 год в минутах
    ],

    'expires_in_minutes' => env('CART_EXPIRES_IN_MINUTES', 60 * 24 * 7), // 1 неделя
];